04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleFluid/channel395/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

#- Run serial
#runApplication foamRun

#- Run parallel
runApplication decomposePar -cellProc
runParallel foamRun
runApplication reconstructPar

#------------------------------------------------------------------------------
